{
  "https://techcrunch.com/tag/autonomous-vehicles/": "autonomous vehicles | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us autonomous vehicles Headlines Only Load More Transportation Uber and Momenta to test autonomous vehicles in Germany in 2026 Rebecca Bellan 2 hours ago Transportation Waymo cleared to offer robotaxi rides at San Jose airport Sean O'Kane 4 days ago Transportation Waymo expands to Denver and Seattle with its Zeekr-made vans Sean O'Kane Sep 2, 2025 In Brief The Boring Company is finally testing Tesla’s ‘Full Self-Driving’ in its Las Vegas tunnels Sean O'Kane Aug 27, 2025 Transportation Waymo approved to start autonomous vehicle testing in New York City Sean O'Kane Aug 22, 2025 Transportation Zoox taps ex-Uber Pool exec’s startup for routing software help Sean O'Kane Aug 20, 2025 Transportation Uber Freight CEO Lior Ron leaves to join self-driving startup Waabi as COO Rebecca Bellan Aug 12, 2025 Transportation Tesla shuts down Dojo, the AI training supercomputer that Musk said would be key to full self-driving Rebecca Bellan Aug 7, 2025 Transportation Federal regulators give Zoox an exemption for its custom-built robotaxis Kirsten Korosec Aug 6, 2025 Transportation Lyft and China’s Baidu look to bring robotaxis to Europe next year Kirsten Korosec Aug 4, 2025 Transportation Waymo taps Avis to manage robotaxi fleet in Dallas Kirsten Korosec Jul 28, 2025 Transportation Lyft to add autonomous shuttles in 2026 as Uber inks more self-driving deals Sean O'Kane Jul 25, 2025 Transportation Uber’s latest robotaxi partner is China’s Baidu Sean O'Kane Jul 15, 2025 Transportation Tesla is already trying to expand its robotaxi service to Arizona Kirsten Korosec Sean O'Kane Jul 10, 2025 Transportation Waymo robotaxis are heading to Philadelphia and NYC Rebecca Bellan Jul 7, 2025 Transportation Travis Kalanick is trying to buy Pony AI — and Uber might help Sean O'Kane Jun 26, 2025 Transportation Uber has Atlanta’s autonomous ride-hailing and delivery market on lock Rebecca Bellan Jun 26, 2025 Transportation Intel hits the brakes on its automotive business, and layoffs have started Kirsten Korosec Jun 25, 2025 Transportation Uber and Waymo’s commercial robotaxi service is open for business in Atlanta Kirsten Korosec Jun 24, 2025 Transportation Tesla’s robotaxis have already caught the attention of federal safety regulators Kirsten Korosec Jun 23, 2025 Transportation Tesla launches robotaxi rides in Austin with big promises and unanswered questions Sean O'Kane Kirsten Korosec Jun 22, 2025 Transportation Amazon’s Zoox opens its first major robotaxi production facility Sean O'Kane Jun 18, 2025 Transportation Applied Intuition raises $600M as it pushes further into defense Sean O'Kane Jun 17, 2025 Transportation Waymo robotaxis are pushing into even more California cities Kirsten Korosec Jun 17, 2025 Transportation Waymo rides cost more than Uber or Lyft — and people are paying anyway Sean O'Kane Jun 12, 2025 Transportation Tesla files new ‘Robotaxi’ trademark applications after prior attempt stalls Sean O'Kane Jun 2, 2025 In Brief Elon Musk is lobbying lawmakers on driverless vehicle rules Kirsten Korosec May 30, 2025 Transportation Musk says Tesla’s self-driving tests will be geofenced to ‘the safest’ parts of Austin Sean O'Kane May 20, 2025 Transportation Amazon’s Zoox to start testing AVs in Atlanta, following Waymo Sean O'Kane May 20, 2025 Transportation Aurora co-founder Sterling Anderson is leaving the self-driving truck startup Kirsten Korosec May 8, 2025 Next October 27-29, 2025 San Francisco Founders: land your investor and sharpen your pitch. Innovators: claim a front-row seat to the future. Regular Bird rates end September 26 Register Now Most Popular Scale AI’s former CTO launches AI agent that could solve big data’s biggest problem Julie Bort OpenAI announces AI-powered hiring platform to take on LinkedIn Maxwell Zeff Atlassian to buy Arc developer The Browser Company for $610M Ivan Mehta Google brings Material 3 Expressive to Pixel 6 and newer devices, along with other features Aisha Malik Tesla’s 4th ‘Master Plan’ reads like LLM-generated nonsense Sean O'Kane BMW, I am so breaking up with you Connie Loizos US and Indian VCs just formed a $1B+ alliance to fund India’s deep tech startups Jagmeet Singh X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunch Staff Contact Us Advertise Crunchboard Jobs Site Map Terms of Service Privacy Policy RSS Terms of Use Code of Conduct Telsa Anthropic Telex Klarna MrBeast Tech Layoffs ChatGPT © 2025 TechCrunch Media LLC.",
  "https://www.wired.com/tag/self-driving-cars/": "Self-Driving Cars | WIRED Skip to main content Menu SECURITY POLITICS THE BIG STORY BUSINESS SCIENCE CULTURE REVIEWS Menu Account Account Newsletters Security Politics The Big Story Business Science Culture Reviews Chevron More Expand The Big Interview Magazine The New Era of Business Travel Events WIRED Insider WIRED Consulting Newsletters Podcasts Video Merch Search Search Sign In Sign In Self-Driving Cars Crash Report Tesla Found Partly Liable in 2019 Autopilot Death Party Ride Uber’s Drive to Become the Kleenex of Robotaxis Italian Job 60 Italian Mayors Want to Be the Unlikely Solution to Self-Driving Cars in Europe Schrodinger's Car Tesla Readies a Taxi Service in San Francisco—but Not With Robotaxis Safe Travels Did Tesla’s Robotaxi Launch Backfire? This Is Why Tesla’s Robotaxi Launch Needed Human Babysitters Star Power Texas Lawmakers Want More Control of the Tesla Robotaxis on Their Roads Self-Driving Cars Tesla’s Robotaxi Service Hits the Road in Texas No Service Ahead of Protests, Waymo Scales Back Robotaxi Service Nationwide Remote Control Tesla’s Robotaxis Are Rolling Out Soon—With One Big Unanswered Question Promise Land There’s a Very Simple Pattern to Elon Musk’s Broken Promises Turn Signal In a Boon for Tesla, Feds Weaken Rules for Reporting on Self-Driving New Model Army BYD Launches Denza in Europe—Another Mighty Impressive EV Brand the US Won’t Get Cancel Culture ‘Over 1 Million’ People Wanted a Cybertruck. open cab Tesla Got a Permit to Operate a Taxi Service in California—but There’s a Catch Uncanny Valley What’s Lost When the Human Drivers Are Gone?",
  "https://techcrunch.com/2025/09/07/uber-and-momenta-to-test-autonomous-vehicles-in-germany-in-2026/": "Uber and Momenta to test autonomous vehicles in Germany in 2026 | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: Getty Images Transportation Uber and Momenta to test autonomous vehicles in Germany in 2026 Rebecca Bellan 11:00 PM PDT · September 7, 2025 Ride-hailing giant Uber and Chinese autonomous vehicle startup Momenta plan to start testing robotaxis in Munich, Germany starting in 2026 – the first continental European city either company has announced publicly – with plans to expand to other markets. The Beijing-based startup has been testing self-driving cars in China since 2018 and is considered a major player in the country’s competitive AV market. “Germany has shaped the global automotive industry for more than a century, and now Munich will help shape the future with autonomous vehicles,” said Dara Khosrowshahi, CEO of Uber, in a statement.",
  "https://techcrunch.com/tag/autonomous-vehicles/page/2/": "autonomous vehicles | Page 2 of 24 | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us autonomous vehicles Headlines Only Load More Biotech & Health Why Hims & Hers turned to the autonomous vehicle industry to find an AI-savvy CTO Kirsten Korosec May 8, 2025 Transportation Tesla’s ‘Robotaxi’ and ‘Cybercab’ trademarks hit roadblocks ahead of June launch Sean O'Kane May 7, 2025 Transportation Uber invests $100M in WeRide to fuel robotaxi expansion across 15 more cities Kirsten Korosec May 7, 2025 Transportation Amazon-owned Zoox issues recall following robotaxi crash Kirsten Korosec May 6, 2025 Transportation Waymo ramps up robotaxi production at new Arizona factory Kirsten Korosec May 5, 2025 Transportation May Mobility to launch robotaxis on Uber platform this year in Texas Rebecca Bellan May 1, 2025 Transportation Aurora launches commercial self-driving truck service in Texas Rebecca Bellan May 1, 2025 Transportation Uber, Volkswagen pair up to launch robotaxi service in US with self-driving, electric microbuses Kirsten Korosec Apr 24, 2025 Transportation Automakers selling cars in China banned from using ‘autonomous driving’ in ads Kirsten Korosec Apr 17, 2025 Transportation Wayve’s self-driving tech is headed to Nissan vehicles Kirsten Korosec Apr 9, 2025 In Brief A Waymo robotaxi got trapped in Chick-fil-A drive-through Kirsten Korosec Apr 9, 2025 Transportation Nuro’s $106M raise backs its shift from delivery robots to licensing autonomy tech Rebecca Bellan Apr 9, 2025 Transportation Amazon’s Zoox begins robotaxi testing in Los Angeles Rebecca Bellan Apr 8, 2025 Transportation Waymo may use interior camera data to train generative AI models, but riders will be able to opt out Rebecca Bellan Apr 8, 2025 Transportation Waymo to launch robotaxi service in Washington, D.C., in 2026 Rebecca Bellan Mar 25, 2025 Transportation What Tesla can and can’t do in California with its new passenger transportation permit Kirsten Korosec Mar 18, 2025 Transportation An AI model from over a decade ago sparked Nvidia’s investment in autonomous vehicles Kirsten Korosec Mar 18, 2025 Transportation GM teams up with Nvidia to bring AI to robots, factories, and self-driving cars Kirsten Korosec Mar 18, 2025 Transportation Waymo expands its robotaxi service across Silicon Valley Sean O'Kane Mar 11, 2025 Featured How Uber’s new product chief is gearing up for robotaxis Kirsten Korosec Mar 6, 2025 Transportation Uber users in Austin are getting matched with Waymo robotaxis Kirsten Korosec Mar 4, 2025 In Brief Waymo has doubled its weekly robotaxi rides in less than a year Kirsten Korosec Feb 27, 2025 Transportation Avride launches sidewalk delivery bots on Uber Eats in Jersey City Rebecca Bellan Feb 13, 2025 Transportation May Mobility launches its first driverless commercial ride-hail service Rebecca Bellan Feb 12, 2025 Transportation Lyft to launch Mobileye-powered robotaxis ‘as soon as 2026,’ starting with Dallas Rebecca Bellan Feb 10, 2025 Transportation Waymo just popped up on the Uber app in Austin ahead of robotaxi launch Kirsten Korosec Feb 5, 2025 Transportation Cruise to slash workforce by nearly 50% after GM cuts funding to robotaxi operations Rebecca Bellan Feb 4, 2025 Transportation Autonomous vehicle testing in California dropped 50%. Kirsten Korosec Jan 31, 2025 Transportation Elon Musk reveals Elon Musk was wrong about Full Self-Driving Sean O'Kane Jan 30, 2025 Transportation Waymo employees can hail fully autonomous rides in Atlanta now Rebecca Bellan Jan 30, 2025 Prev Next October 27-29, 2025 San Francisco Founders: land your investor and sharpen your pitch. Innovators: claim a front-row seat to the future.",
  "https://www.wired.com/story/ubers-drive-to-become-the-kleenex-of-robotaxis/": "Self-driving car developers want access to Uber’s network—but because there simply aren’t that many self-driving cars, the company is less useful in the near-term. It has its own autonomous vehicle technology subsidiary, which is building autonomous vehicle software. Tesla appears to want to own its whole self-driving car operation: the technology, the cars, the maintenance, and the app that powers it—but Uber could still be a great robotaxi partner, Khosrowshahi said.",
  "https://www.wired.com/story/tesla-robotaxi-service-launches-austin-texas/": "That tech, which includes the older Autopilot feature and the newer Full Self-Driving (Supervised) feature, is distinct from Tesla’s autonomous features. In other words: There’s a big difference between a handful of self-driving cars and a self-driving service. Read More Staff Writer X Topics Self-Driving Cars Tesla Elon Musk Autonomous Vehicles Electric Vehicles cars robotaxis Read More Automaker Geely Launched Its Own Satellites Into Space, Highlighting China’s Ambitions It’s a bird, it’s a plane—it’s the latest sign that Chinese automakers intend to dominate the global car industry for decades to come.",
  "https://www.wired.com/story/as-robotaxi-rides-begin-we-still-dont-know-the-mystery-of-teslas-human-helpers/": "Shouldn’t an autonomous vehicle operate, well, autonomously ? The tech, though impressive, is still in development, and the autonomous systems still need humans to guide them through less-common and especially sticky road situations. It’s understanding the limits of today’s technology—and what it takes to run a profitable business based on self-driving cars.",
  "https://www.wired.com/story/uncanny-valley-podcast-self-driving-cars/": "Generally self-driving cars work by placing a ton of sensors on cars and using those sensors, which include cameras, radar, and lidar, to have the car understand where it is in space. What are the things that you're looking at about self-driving cars that you want to see change or get better or go away? We've rent that through regulation, and I actually think that self-driving cars present a really interesting opportunity to think robustly about what we want our cities to look like and what we want our streets to look like, and who we want our streets to be designed for.",
  "https://www.wired.com/story/byd-free-self-driving-tech-gods-eye/": "However, BYD’s ADAS system could be as misleadingly named as Tesla’s Full Self-Driving (FSD). China, the world’s biggest car market , has adopted semi-automated driving more readily than anywhere else, with most domestic automakers providing technology between SAE’s Level 2 and Level 3. They’re kind of wrapped up in this belief that this is an autonomous vehicle, because it’s tweeted about that way.” Musk has been promising the imminent arrival of fully autonomous cars since at least 2016.",
  "https://www.uber.com/us/en/autonomous/": "Uber AV: Autonomous Mobility and Delivery | Uber Please enable Javascript Please enable Javascript Skip to main content Uber Ride Drive Business Uber Eats About About us Our offerings How Uber works Sustainability Newsroom Investor relations Autonomous Blog Careers More No results EN Help Log in Sign up Ride Drive & deliver Uber Eats Business Uber Log in Sign up Ride Drive & deliver Uber Eats Business , Driving autonomous forward At Uber, it's our mission to reimagine the way the world moves for the better—and it's clear that autonomous vehicles (AVs)  will play a part in our future. For autonomous vehicles, that partner is Uber. And with exciting programs already launched with key players across the globe, we’re driving the future of autonomous transportation forward, together.",
  "https://techcrunch.com/2025/05/08/hims-hers-ceo-turned-to-the-autonomous-vehicle-industry-to-find-an-ai-savvy-exec/": "Why Hims & Hers turned to the autonomous vehicle industry to find an AI-savvy CTO | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: Hims & Hers Biotech & Health Why Hims & Hers turned to the autonomous vehicle industry to find an AI-savvy CTO Kirsten Korosec 3:50 AM PDT · May 8, 2025 Hims & Hers, the telehealth and wellness company, has hired a veteran of the autonomous vehicle industry as its next chief technology officer. “I was looking very much at leaders in the autonomous driving space, explicitly because you’re talking about leveraging technology and data and AI in an extremely high-sensitive environment where you have people’s lives at risk,” Dudum said in an interview. Elshenawy, who holds more than 10 patents across AI, robotics, and autonomous vehicles, told TechCrunch the move “is not as big of a leap as it might seem.” “Self-driving cars use AI to make real-time decisions in complex, high-stakes and heavily regulated environments, where earning trust is everything,” he said in an email to TechCrunch.",
  "https://techcrunch.com/2025/05/01/aurora-launches-commercial-self-driving-truck-service-in-texas/": "In order to remain in compliance with that rule and still deploy a fully driverless service, it would make sense for Aurora to have a human-driven car trail its trucks whenever they’re in operation. “In addition to our driverless trucks, we have supervised autonomous trucks that are delivering goods for customers everyday between Dallas and Houston,” Chibidakis said. Topics Aurora Innovation , autonomous vehicles , self-driving trucks , Transportation Rebecca Bellan Senior Reporter Rebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence.",
  "https://techcrunch.com/2025/04/24/uber-and-volkswagen-pair-up-to-launch-robotaxi-service-with-self-driving-electric-microbuses/": "Uber, Volkswagen pair up to launch robotaxi service in US with self-driving, electric microbuses | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: VW/Uber Transportation Uber, Volkswagen pair up to launch robotaxi service in US with self-driving, electric microbuses Kirsten Korosec 5:00 AM PDT · April 24, 2025 Volkswagen of America and Uber on Thursday unveiled an ambitious plan to launch a commercial robotaxi service — using autonomous electric VW ID. The agency regulates autonomous vehicle testing and deployment in the state, and the California Public Utilities Commission handles permitting for the commercial ride-hailing component of robotaxi services. Topics autonomous vehicles , electric robotaxis , Transportation , Uber , volkswagen Kirsten Korosec Transportation Editor Kirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade.",
  "https://techcrunch.com/2025/04/17/automakers-selling-cars-in-china-banned-from-using-autonomous-driving-in-ads/": "Automakers selling cars in China banned from using 'autonomous driving' in ads | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: VCG/VCG / Getty Images Transportation Automakers selling cars in China banned from using ‘autonomous driving’ in ads Kirsten Korosec 11:49 AM PDT · April 17, 2025 China is cracking down on how automakers advertise driver-assistance features, banning terms like “autonomous driving,” “self-driving,” and “smart driving,” Reuters reported, citing a transcript of a meeting between the government and industry representatives. It also follows Tesla’s rollout of its “Full Self-Driving software” branding used for its advanced driver-assistance system. In China, Tesla changed the FSD name to “Intelligent Assisted Driving.” Topics ADAS , autonomous vehicles , China , Transportation Kirsten Korosec Transportation Editor Kirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade.",
  "https://techcrunch.com/2025/04/09/wayves-self-driving-tech-is-headed-to-nissan-vehicles/": "Wayve's self-driving tech is headed to Nissan vehicles | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: Wayve Transportation Wayve’s self-driving tech is headed to Nissan vehicles Kirsten Korosec 7:00 PM PDT · April 9, 2025 Nissan said it will use self-driving software developed by Wayve to beef up its advanced driver-assistance system starting in 2027, a landmark deal for the buzzy U.K. Wayve’s self-learning approach is seen as particularly appealing to automakers because it’s not reliant on specific sensors or HD maps. The automated driving software captures data from those sensors, which directly informs the driving decisions of the system.",
  "https://techcrunch.com/2025/03/18/gm-teams-up-with-nvidia-to-bring-ai-to-robots-factories-and-self-driving-cars/": "Nvidia has also developed an autonomous vehicle platform for automakers that includes an operating system called DriveOS to provide real-time AI processing and integration of advanced driving and cockpit features. GM is in the process of absorbing its self-driving car subsidiary Cruise and combining it with its own efforts to develop driver-assistance features — and eventually fully autonomous personal vehicles. Topics AI , autonomous vehicles , General Motors , GTC , nvidia , nvidia gtc , Robotics , Transportation Kirsten Korosec Transportation Editor Kirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade.",
  "https://techcrunch.com/tag/autonomous-vehicles/page/3/": "autonomous vehicles | Page 3 of 24 | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us autonomous vehicles Headlines Only Load More In Brief Waymo reportedly testing robotaxis in 10 new cities in 2025 Rebecca Bellan Jan 29, 2025 Transportation Waymo begins testing robotaxis on LA freeways Kirsten Korosec Jan 28, 2025 Transportation GM expects to save up to $1 billion on Cruise costs Rebecca Bellan Jan 28, 2025 In Brief Waymo lobbyist activity in SF skyrocketed in 2024 Kirsten Korosec Jan 24, 2025 Transportation Biden admin’s final rule banning Chinese connected cars also bars robotaxi testing on US roads Rebecca Bellan Jan 14, 2025 Transportation CES 2025: Self-driving cars were everywhere, plus other transportation tech trends Kirsten Korosec Rebecca Bellan Jan 12, 2025 Transportation We talked to the guy who was stuck in a Waymo robotaxi on a dizzying loop Rebecca Bellan Jan 8, 2025 Transportation Zeekr RT, the robotaxi built for Waymo, has the tiniest wipers Kirsten Korosec Jan 7, 2025 Transportation At CES 2025, Uber teams up with Nvidia to scale autonomous driving faster Rebecca Bellan Jan 7, 2025 Transportation May Mobility reveals electric autonomous minibus at CES 2025 Rebecca Bellan Jan 7, 2025 Robotics John Deere’s new robot lawnmower is coming for landscapers’ jobs Sean O'Kane Jan 6, 2025 Transportation A Waymo robotaxi and a Serve delivery robot collided in Los Angeles Rebecca Bellan Dec 31, 2024 Transportation The trends that shaped EVs, robotaxis, and electric flight in 2024 Kirsten Korosec Rebecca Bellan Dec 27, 2024 Transportation The biggest flops and fizzles in 2024 transportation, from Apple Car to Fisker Kirsten Korosec Dec 22, 2024 In Brief Tesla is courting Texas cities to test its promised robotaxi service Sean O'Kane Dec 19, 2024 Transportation Slip Robotics snags $28M for its bots that can load a truck in five minutes Kirsten Korosec Dec 17, 2024 Transportation Waymo robotaxis are coming to Tokyo in 2025 Kirsten Korosec Dec 16, 2024 In Brief The federal crash-reporting rule Tesla opposes could be on the chopping block Kirsten Korosec Dec 13, 2024 In Brief Tesla’s loss is Zoox’s gain Kirsten Korosec Dec 12, 2024 Transportation Microsoft will take an $800M hit over Cruise robotaxi shutdown Kirsten Korosec Dec 11, 2024 In Brief Honda cuts funding to robotaxi venture with Cruise and GM in Japan Rebecca Bellan Dec 11, 2024 Transportation Cruise employees ‘blindsided’ by GM’s plan to end robotaxi program Kirsten Korosec Rebecca Bellan Dec 11, 2024 Transportation GM is giving up on Cruise robotaxis, pivots to personal autonomous vehicles Kirsten Korosec Sean O'Kane Dec 11, 2024 In Brief San Francisco is the most prepared city for new transportation tech Kirsten Korosec Dec 10, 2024 Transportation Uber and WeRide launch robotaxi service in Abu Dhabi Rebecca Bellan Dec 6, 2024 Transportation Waymo outsources fleet operations to African fintech Moove in Phoenix and, soon, Miami Rebecca Bellan Tage Kene-Okafor Dec 5, 2024 In Brief Pony AI’s valuation hits $5.25B after Nasdaq debut Rebecca Bellan Nov 27, 2024 Fundraising Teleo wants to help the robotics industry reach its ‘ChatGPT moment’ Rebecca Bellan Nov 21, 2024 In Brief May Mobility to test driverless shuttles in Ann Arbor Rebecca Bellan Nov 20, 2024 In Brief Chinese AV startup Pony AI boosts its IPO goal to $260M Sean O'Kane Nov 20, 2024 Prev Next October 27-29, 2025 San Francisco Founders: land your investor and sharpen your pitch. Innovators: claim a front-row seat to the future. Regular Bird rates end September 26 Register Now Most Popular Scale AI’s former CTO launches AI agent that could solve big data’s biggest problem Julie Bort OpenAI announces AI-powered hiring platform to take on LinkedIn Maxwell Zeff Tesla’s 4th ‘Master Plan’ reads like LLM-generated nonsense Sean O'Kane BMW, I am so breaking up with you Connie Loizos US and Indian VCs just formed a $1B+ alliance to fund India’s deep tech startups Jagmeet Singh Homicide at Burning Man turns Silicon Valley’s desert playground into a crime scene Connie Loizos I’m really impressed with this $400 portable projector Lauren Forristal X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunch Staff Contact Us Advertise Crunchboard Jobs Site Map Terms of Service Privacy Policy RSS Terms of Use Code of Conduct Telsa Anthropic Telex Klarna MrBeast Tech Layoffs ChatGPT © 2025 TechCrunch Media LLC.",
  "https://www.wired.com/story/uber-gives-up-self-driving-dream/": "Uber slowed development of self-driving vehicles after a fatal crash in 2018. The move continues the consolidation in self-driving technology, as the process of creating safe, secure autonomous vehicles continues to cost more and take longer than prognosticators once believed. Aurora isn’t planning to build a self-driving car or truck itself; instead, it’s developing the complex software that will power autonomous vehicles.",
  "https://techcrunch.com/2025/03/04/didi-reportedly-seeking-funds-for-self-driving-unit-at-5b-valuation/?utm_source=chatgpt.com": "Investor interest in self-driving cars is high in China on the backs of IPOs from WeRide and Pony AI , which have a market capitalization of $4.7 billion and $5.25 billion, respectively, as of Tuesday morning. The Chinese AV company is testing a fleet of roughly 200 autonomous vehicles across Beijing, Guangzhou, and Shanghai, but it has not yet begun commercial robotaxi operations. Related Transportation Uber and Momenta to test autonomous vehicles in Germany in 2026 Rebecca Bellan 2 hours ago Transportation Didi’s autonomous vehicle arm raises $149M from state investors Rita Liao Oct 12, 2023 Transportation Tesla’s China rival XPeng buys ride-hailing giant Didi’s smart EV assets for $744M Rita Liao Aug 27, 2023 Latest in Transportation Transportation InDrive has big plans to become a global ‘super app’ where others have failed Jagmeet Singh 21 minutes ago Transportation Uber and Momenta to test autonomous vehicles in Germany in 2026 Rebecca Bellan 2 hours ago Transportation Hyundai’s eVTOL startup Supernal pauses work following CEO and CTO departures Sean O'Kane 13 hours ago X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunch Staff Contact Us Advertise Crunchboard Jobs Site Map Terms of Service Privacy Policy RSS Terms of Use Code of Conduct Telsa Anthropic Telex Klarna MrBeast Tech Layoffs ChatGPT © 2025 TechCrunch Media LLC.",
  "https://www.wired.com/tag/autonomous-vehicles/": "Autonomous Vehicles | Latest News, Photos & Videos | WIRED Skip to main content Menu SECURITY POLITICS THE BIG STORY BUSINESS SCIENCE CULTURE REVIEWS Menu Account Account Newsletters Security Politics The Big Story Business Science Culture Reviews Chevron More Expand The Big Interview Magazine The New Era of Business Travel Events WIRED Insider WIRED Consulting Newsletters Podcasts Video Merch Search Search Sign In Sign In Autonomous Vehicles Gear Uber’s Drive to Become the Kleenex of Robotaxis Gear 60 Italian Mayors Want to Be the Unlikely Solution to Self-Driving Cars in Europe Gear Did Tesla’s Robotaxi Launch Backfire? Automakers Want to Charge Extra for It Gear 11 More of the Most Fun Things We’ve Seen at CES Gear Wayve’s AI Self-Driving System Is Here to Drive Like a Human and Take On Waymo and Tesla Security Emergency Vehicle Lights Can Screw Up a Car’s Automated Driving System Gear Parallel Parking Is Stressful. That’s a Big Deal Gear Japan Launches a Development Project for Self-Driving EV Taxis Business Toyota Pulls Off a Fast and Furious Demo With Dual Drifting AI-Powered Race Cars More Stories WIRED is where tomorrow is realized."
}